Acquiring state lock. This may take a few moments...
module.lambda_layer.data.archive_file.pymysql_layer: Reading...
module.lambda_layer.data.archive_file.pymysql_layer: Read complete after 0s [id=fdbcd5e1107f297ea43bc9c2c8cf137dabe8d5aa]
module.iam.aws_iam_role.lambda_exec_role: Refreshing state... [id=lambda_sql_initializer_role]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-0c139126ab6f52636]
module.iam.aws_iam_role.eks_cluster_role: Refreshing state... [id=EKSClusterRole]
module.monitoring.aws_cloudwatch_log_metric_filter.lambda_mail_fail: Refreshing state... [id=lambda-mail-fail]
module.iam.aws_iam_policy.lambda_vpc_access_policy: Refreshing state... [id=arn:aws:iam::635140758252:policy/lambda_vpc_access_policy]
module.monitoring.aws_sns_topic.monitoring_alerts: Refreshing state... [id=arn:aws:sns:ap-northeast-2:635140758252:monitoring-alerts]
module.iam.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::635140758252:policy/lambda_sql_initializer_policy]
module.monitoring.aws_iam_policy.grafana_cloudwatch: Refreshing state... [id=arn:aws:iam::635140758252:policy/grafana-cloudwatch-policy]
module.iam.aws_iam_role.eks_node_role: Refreshing state... [id=EKSNodeInstanceRole]
module.lambda_layer.aws_lambda_layer_version.pymysql: Refreshing state... [id=arn:aws:lambda:ap-northeast-2:635140758252:layer:pymysql-layer:38]
module.iam.aws_iam_role_policy_attachment.lambda_policy_attachment: Refreshing state... [id=lambda_sql_initializer_role-20250619010241756400000003]
module.iam.aws_iam_role_policy_attachment.lambda_vpc_policy_attachment: Refreshing state... [id=lambda_sql_initializer_role-20250619010241746800000002]
module.iam.aws_iam_role_policy_attachment.eks_cni: Refreshing state... [id=EKSNodeInstanceRole-20250619010241744300000001]
module.iam.aws_iam_role_policy_attachment.eks_worker_node: Refreshing state... [id=EKSNodeInstanceRole-20250619010241785600000004]
module.iam.aws_iam_role_policy_attachment.ec2_container_registry_read_only: Refreshing state... [id=EKSNodeInstanceRole-20250619010241786600000005]
module.iam.aws_iam_role_policy_attachment.eks_cluster_attach: Refreshing state... [id=EKSClusterRole-20250619010241791300000006]
module.monitoring.aws_sns_topic_subscription.email["oosuoos@gmail.com"]: Refreshing state... [id=arn:aws:sns:ap-northeast-2:635140758252:monitoring-alerts:6945f494-f337-402c-aea9-2f81c39d2d75]
module.monitoring.aws_sns_topic_subscription.email["jintonylove@gmail.com"]: Refreshing state... [id=arn:aws:sns:ap-northeast-2:635140758252:monitoring-alerts:4d424624-6ec3-41e6-8ae7-aa8e3d0234b7]
module.monitoring.aws_sns_topic_subscription.email["sunyj1225@gmail.com"]: Refreshing state... [id=arn:aws:sns:ap-northeast-2:635140758252:monitoring-alerts:511c9e7e-9db0-4211-9673-91e18aa32200]
module.monitoring.aws_sns_topic_subscription.email["skdurtlxx@gmail.com"]: Refreshing state... [id=arn:aws:sns:ap-northeast-2:635140758252:monitoring-alerts:d73a68a6-0698-4fb0-96f3-337239fae44e]
module.monitoring.aws_sns_topic_subscription.email["95eksldpf@gmail.com"]: Refreshing state... [id=arn:aws:sns:ap-northeast-2:635140758252:monitoring-alerts:20fc3360-0327-41b4-87b1-650dcf81cfbb]
module.monitoring.aws_cloudwatch_metric_alarm.mail_fail_alarm: Refreshing state... [id=MailSendFailAlarm]
module.subnet.aws_subnet.private_3b: Refreshing state... [id=subnet-04b04ffc940e5102e]
module.subnet.aws_subnet.public_1a: Refreshing state... [id=subnet-06b509e37e71b8382]
module.subnet.aws_subnet.public_2c: Refreshing state... [id=subnet-0a100c84070398b39]
module.security_group.aws_security_group.rds_sg: Refreshing state... [id=sg-0b9440eaed3d94f1d]
module.security_group.aws_security_group.app_sg: Refreshing state... [id=sg-031431cd7cb2db44b]
module.subnet.aws_subnet.private_4d: Refreshing state... [id=subnet-0639fdfe2b40eda52]
module.rds.aws_db_subnet_group.this: Refreshing state... [id=news-rds]
module.eks.aws_ecr_lifecycle_policy.spring_app: Refreshing state... [id=spring-app]
module.nat.aws_eip.nat_eip: Refreshing state... [id=eipalloc-0a1e02672d57dba68]
module.eks.aws_eks_cluster.this: Refreshing state... [id=news-cluster]
module.igw.aws_internet_gateway.this: Refreshing state... [id=igw-0e3108a1e9f603472]
module.rds.aws_db_parameter_group.timezone: Refreshing state... [id=news-rds-timezone]
module.nat.aws_nat_gateway.nat: Refreshing state... [id=nat-05feda0fd0e32480f]
module.route.aws_route_table.public: Refreshing state... [id=rtb-0a8e68f1887324df2]
module.route.aws_route_table.private: Refreshing state... [id=rtb-06cfa389f0f1c597d]
module.eks.aws_iam_openid_connect_provider.eks: Refreshing state... [id=arn:aws:iam::635140758252:oidc-provider/oidc.eks.ap-northeast-2.amazonaws.com/id/0DCE3E2F0EEF6ACB802A5B2B8A227D06]
module.eks.aws_eks_node_group.default: Refreshing state... [id=news-cluster:news-cluster-ng]
module.monitoring.aws_iam_role.grafana_irsa: Refreshing state... [id=eks-irsa-grafana]
module.monitoring.aws_iam_role_policy_attachment.grafana_attach: Refreshing state... [id=eks-irsa-grafana-2025061901100185480000000b]
module.monitoring.kubernetes_service_account.grafana: Refreshing state... [id=monitoring/grafana]
module.route.aws_route_table_association.public_1: Refreshing state... [id=rtbassoc-04c8f681da1a2b95f]
module.route.aws_route.public_route: Refreshing state... [id=r-rtb-0a8e68f1887324df21080289494]
module.route.aws_route_table_association.public_2: Refreshing state... [id=rtbassoc-0bc7be5f38412a0e6]
module.route.aws_route_table_association.private_2: Refreshing state... [id=rtbassoc-04e39377b79015eba]
module.route.aws_route.private_route: Refreshing state... [id=r-rtb-06cfa389f0f1c597d1080289494]
module.route.aws_route_table_association.private_1: Refreshing state... [id=rtbassoc-09e5eb99cd82c8b5e]
helm_release.kube_prometheus_stack: Refreshing state... [id=kube-prometheus-stack]
module.rds.aws_db_instance.this: Refreshing state... [id=db-JSH7KZ3JTPIKY5O4FFUOLAREFM]
module.monitoring.aws_cloudwatch_dashboard.main: Refreshing state... [id=main-monitoring]
module.monitoring.aws_cloudwatch_metric_alarm.rds_cpu_high: Refreshing state... [id=RDS-CPU-High]
module.sql_initializer.aws_lambda_function.sql_initializer: Refreshing state... [id=rds-sql-initializer]
module.docker_images.aws_lambda_function.news-crawler_mw: Refreshing state... [id=news-crawler-lambda]
module.sending_news.aws_lambda_function.this: Refreshing state... [id=news-lambda-handler]
module.eventbridge_scheduler.aws_cloudwatch_event_rule.schedule["crawler"]: Refreshing state... [id=crawler]
module.eventbridge_scheduler.aws_cloudwatch_event_rule.schedule["sending_news"]: Refreshing state... [id=sending_news]
module.monitoring.helm_release.grafana: Refreshing state... [id=grafana-monitoring]
module.eventbridge_scheduler.aws_lambda_permission.allow_eventbridge["sending_news"]: Refreshing state... [id=AllowExecutionFromEventBridge-sending_news]
module.eventbridge_scheduler.aws_cloudwatch_event_target.lambda["crawler"]: Refreshing state... [id=crawler-crawler]
module.eventbridge_scheduler.aws_lambda_permission.allow_eventbridge["crawler"]: Refreshing state... [id=AllowExecutionFromEventBridge-crawler]
module.eventbridge_scheduler.aws_cloudwatch_event_target.lambda["sending_news"]: Refreshing state... [id=sending_news-sending-news]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.rds.aws_db_parameter_group.timezone will be updated in-place
  ~ resource "aws_db_parameter_group" "timezone" {
        id           = "news-rds-timezone"
        name         = "news-rds-timezone"
        tags         = {}
        # (7 unchanged attributes hidden)

      + parameter {
          + apply_method = "immediate"
          + name         = "character_set_client"
          + value        = "utf8mb4"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "character_set_connection"
          + value        = "utf8mb4"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "character_set_results"
          + value        = "utf8mb4"
        }

        # (3 unchanged blocks hidden)
    }

  # module.sending_news.data.archive_file.lambda_zip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "lambda_zip" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "../../modules/lambda/sending_news/lambda_function.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "../../modules/lambda/sending_news/lambda_function.py"
      + type                = "zip"
    }

  # module.sending_news.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "news-lambda-handler"
      ~ last_modified                  = "2025-06-19T01:16:01.855+0000" -> (known after apply)
      ~ source_code_hash               = "tvQkWU0Qmv0QUlbqIruDqJwHLgfxgbL/Son8UUNYXqY=" -> (known after apply)
        tags                           = {}
        # (28 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.sql_initializer.data.archive_file.lambda_zip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "lambda_zip" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "../../modules/lambda/sql_initializer/sql_init.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "../../modules/lambda/sql_initializer"
      + type                = "zip"
    }

  # module.sql_initializer.aws_lambda_function.sql_initializer will be updated in-place
  ~ resource "aws_lambda_function" "sql_initializer" {
        id                             = "rds-sql-initializer"
      ~ last_modified                  = "2025-06-19T01:18:06.121+0000" -> (known after apply)
      ~ source_code_hash               = "Oo32G/n0iZbMKF7hnjQFzs8eNsKbz4VOaIT4Gp8yl/0=" -> (known after apply)
        tags                           = {}
        # (28 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "db_password" but a value
was found in file "terraform.auto.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

<!-- Sticky Pull Request Comment -->